package Ch09ClassBasic;

public class C01ClassBasic {

	public static void main(String[] args) {
		//1 객체
		//->현실 존재(독립적이고 배타적인 공간을 차지한다) 사물
        //->실존하는 객체의 처리를 위해 일부정보를 추출하여(추상화) 프로그램의 메모리공간에
		//담아놓은 단위(==인스턴스)
	    //객체지향->객체의 일부정보만을 추출하기 때문에 지향이라는 말이 붙음
	    
		//2 객체의 구조
		//속성: 객체를 표현하는 세부 데이터 단위(변수로 저장)
		//기능: 개체가 구현할 수 있는 행위 단위(함수로 저장)
		
		//ex.에어컨
		//속성: 로고문양, 팬, EVA, Display, Motor
		//기능: Power on/off, 제습, 냉방
	
		//3 클래스(존재하지 않음)
		//객체에 필요한 공간을 생성하기 위해 미리 선언된 자료형
	
	}

}
